const XLSX = require('xlsx')

// const wb = XLSX.utils.book_new()
// var ws_data = [
//   [ "S", "h", "e", "e", "t", "J", "S" ],
//   [  1 ,  2 ,  3 ,  4 ,  5 ]
// ];
// var ws = XLSX.utils.aoa_to_sheet(ws_data);
// XLSX.utils.book_append_sheet(wb, ws, 'whatever');
// XLSX.writeFile(wb, 'out.xlsx')

// var workbook = XLSX.readFile('/Users/zhaozhe/Documents/template.xlsx')
// console.info(workbook.Sheets['导入数据表'])

const sheet = { '!ref': 'A1:BG4',
A1:
 { t: 's', v: '用户订单号', r: '<t>用户订单号</t>', h: '用户订单号', w: '用户订单号' },
B1:
 { t: 's', v: '寄件方信息', r: '<t>寄件方信息</t>', h: '寄件方信息', w: '寄件方信息' },
F1:
 { t: 's', v: '收件方信息', r: '<t>收件方信息</t>', h: '收件方信息', w: '收件方信息' },
K1:
 { t: 's',
   v: '运单其它信息',
   r: '<t>运单其它信息</t>',
   h: '运单其它信息',
   w: '运单其它信息' },
B2:
 { t: 's', v: '寄件公司', r: '<t>寄件公司</t>', h: '寄件公司', w: '寄件公司' },
C2: { t: 's', v: '联系人', r: '<t>联系人</t>', h: '联系人', w: '联系人' },
D2:
 { t: 's', v: '联系电话', r: '<t>联系电话</t>', h: '联系电话', w: '联系电话' },
E2:
 { t: 's', v: '寄件地址', r: '<t>寄件地址</t>', h: '寄件地址', w: '寄件地址' },
F2:
 { t: 's', v: '收件公司', r: '<t>收件公司</t>', h: '收件公司', w: '收件公司' },
G2: { t: 's', v: '联系人', r: '<t>联系人</t>', h: '联系人', w: '联系人' },
H2:
 { t: 's', v: '联系电话', r: '<t>联系电话</t>', h: '联系电话', w: '联系电话' },
I2:
 { t: 's', v: '手机号码', r: '<t>手机号码</t>', h: '手机号码', w: '手机号码' },
J2:
 { t: 's',
   v: '收件详细地址',
   r: '<t>收件详细地址</t>',
   h: '收件详细地址',
   w: '收件详细地址' },
K2:
 { t: 's', v: '付款方式', r: '<t>付款方式</t>', h: '付款方式', w: '付款方式' },
L2:
 { t: 's',
   v: '第三方付月结卡号',
   r: '<t>第三方付月结卡号</t>',
   h: '第三方付月结卡号',
   w: '第三方付月结卡号' },
M2:
 { t: 's', v: '托寄物品', r: '<t>托寄物品</t>', h: '托寄物品', w: '托寄物品' },
N2:
 { t: 's', v: '托寄物内容', r: '<t>托寄物内容</t>', h: '托寄物内容', w: '托寄物内容' },
O2:
 { t: 's', v: '托寄物编码', r: '<t>托寄物编码</t>', h: '托寄物编码', w: '托寄物编码' },
P2:
 { t: 's', v: '托寄物数量', r: '<t>托寄物数量</t>', h: '托寄物数量', w: '托寄物数量' },
Q2: { t: 's', v: '件数', r: '<t>件数</t>', h: '件数', w: '件数' },
R2:
 { t: 's',
   v: '实际重量\r\n（KG）',
   r: '<t>实际重量\r\n（KG）</t>',
   h: '实际重量&#x000d;<br/>（KG）',
   w: '实际重量\r\n（KG）' },
S2:
 { t: 's',
   v: '计费重量\r\n（KG）',
   r: '<t>计费重量\r\n（KG）</t>',
   h: '计费重量&#x000d;<br/>（KG）',
   w: '计费重量\r\n（KG）' },
T2:
 { t: 's', v: '业务类型', r: '<t>业务类型</t>', h: '业务类型', w: '业务类型' },
U2:
 { t: 's',
   v: '是否代收货款',
   r: '<t>是否代收货款</t>',
   h: '是否代收货款',
   w: '是否代收货款' },
V2:
 { t: 's',
   v: '代收货款金额',
   r: '<t>代收货款金额</t>',
   h: '代收货款金额',
   w: '代收货款金额' },
W2:
 { t: 's', v: '代收卡号', r: '<t>代收卡号</t>', h: '代收卡号', w: '代收卡号' },
X2:
 { t: 's', v: '是否保价', r: '<t>是否保价</t>', h: '是否保价', w: '是否保价' },
Y2:
 { t: 's', v: '保价金额', r: '<t>保价金额</t>', h: '保价金额', w: '保价金额' },
Z2:
 { t: 's',
   v: '标准化包装（元）',
   r: '<t>标准化包装（元）</t>',
   h: '标准化包装（元）',
   w: '标准化包装（元）' },
AA2:
 { t: 's',
   v: '其它费用\r\n（元）',
   r: '<t>其它费用\r\n（元）</t>',
   h: '其它费用&#x000d;<br/>（元）',
   w: '其它费用\r\n（元）' },
AB2:
 { t: 's',
   v: '个性化包装（元）',
   r: '<t>个性化包装（元）</t>',
   h: '个性化包装（元）',
   w: '个性化包装（元）' },
AC2:
 { t: 's', v: '是否自取', r: '<t>是否自取</t>', h: '是否自取', w: '是否自取' },
AD2:
 { t: 's', v: '是否签回单', r: '<t>是否签回单</t>', h: '是否签回单', w: '是否签回单' },
AE2:
 { t: 's',
   v: '是否定时派送',
   r:
    '<r><t>是否</t></r><r><rPr><sz val="10" /><rFont val="宋体" /><family val="3" /><charset val="134" /></rPr><t>定时派送</t></r>',
   h: '是否<span style="font-size:10pt;">定时派送</span>',
   w: '是否定时派送' },
AF2:
 { t: 's', v: '派送日期', r: '<t>派送日期</t>', h: '派送日期', w: '派送日期' },
AG2:
 { t: 's', v: '派送时段', r: '<t>派送时段</t>', h: '派送时段', w: '派送时段' },
AH2:
 { t: 's',
   v: '是否电子验收',
   r: '<t>是否电子验收</t>',
   h: '是否电子验收',
   w: '是否电子验收' },
AI2:
 { t: 's', v: '拍照类型', r: '<t>拍照类型</t>', h: '拍照类型', w: '拍照类型' },
AJ2:
 { t: 's',
   v: '是否保单配送',
   r: '<t>是否保单配送</t>',
   h: '是否保单配送',
   w: '是否保单配送' },
AK2:
 { t: 's',
   v: '是否拍照验证',
   r: '<t>是否拍照验证</t>',
   h: '是否拍照验证',
   w: '是否拍照验证' },
AL2:
 { t: 's', v: '是否易碎件', r: '<t>是否易碎件</t>', h: '是否易碎件', w: '是否易碎件' },
AM2:
 { t: 's', v: '易碎金额', r: '<t>易碎金额</t>', h: '易碎金额', w: '易碎金额' },
AN2:
 { t: 's',
   v: '是否票据专送',
   r: '<t>是否票据专送</t>',
   h: '是否票据专送',
   w: '是否票据专送' },
AO2:
 { t: 's',
   v: '是否超长超重服务',
   r: '<t>是否超长超重服务</t>',
   h: '是否超长超重服务',
   w: '是否超长超重服务' },
AP2:
 { t: 's',
   v: '超长超重服务费',
   r: '<t>超长超重服务费</t>',
   h: '超长超重服务费',
   w: '超长超重服务费' },
AQ2:
 { t: 's',
   v: '是否上门安装',
   r: '<t>是否上门安装</t>',
   h: '是否上门安装',
   w: '是否上门安装' },
AR2:
 { t: 's', v: '安装类型', r: '<t>安装类型</t>', h: '安装类型', w: '安装类型' },
AS2: { t: 's', v: '收件员', r: '<t>收件员</t>', h: '收件员', w: '收件员' },
AT2:
 { t: 's', v: '寄方签名', r: '<t>寄方签名</t>', h: '寄方签名', w: '寄方签名' },
AU2:
 { t: 's', v: '寄件日期', r: '<t>寄件日期</t>', h: '寄件日期', w: '寄件日期' },
AV2:
 { t: 's',
   v: '签收短信通知(MSG)',
   r: '<t>签收短信通知(MSG)</t>',
   h: '签收短信通知(MSG)',
   w: '签收短信通知(MSG)' },
AW2:
 { t: 's',
   v: '派件出仓短信(SMS)',
   r: '<t>派件出仓短信(SMS)</t>',
   h: '派件出仓短信(SMS)',
   w: '派件出仓短信(SMS)' },
AX2:
 { t: 's',
   v: '寄方客户备注',
   r: '<t>寄方客户备注</t>',
   h: '寄方客户备注',
   w: '寄方客户备注' },
AY2:
 { t: 's', v: '长(cm)', r: '<t>长(cm)</t>', h: '长(cm)', w: '长(cm)' },
AZ2:
 { t: 's', v: '宽(cm)', r: '<t>宽(cm)</t>', h: '宽(cm)', w: '宽(cm)' },
BA2:
 { t: 's', v: '高(cm)', r: '<t>高(cm)</t>', h: '高(cm)', w: '高(cm)' },
BB2:
 { t: 's', v: '扩展字段1', r: '<t>扩展字段1</t>', h: '扩展字段1', w: '扩展字段1' },
BC2:
 { t: 's', v: '扩展字段2', r: '<t>扩展字段2</t>', h: '扩展字段2', w: '扩展字段2' },
BD2:
 { t: 's', v: '扩展字段3', r: '<t>扩展字段3</t>', h: '扩展字段3', w: '扩展字段3' },
BE2:
 { t: 's', v: '扩展字段4', r: '<t>扩展字段4</t>', h: '扩展字段4', w: '扩展字段4' },
BF2:
 { t: 's',
   v: '体积(cm³)',
   r: '<t>体积(cm³)</t>',
   h: '体积(cm³)',
   w: '体积(cm³)' },
J3:
 { t: 's', v: '详细地址', r: '<t>详细地址</t>', h: '详细地址', w: '详细地址' },
B4: { t: 's', v: '王源', r: '<t>王源</t>', h: '王源', w: '王源' },
C4: { t: 's', v: '王源', r: '<t>王源</t>', h: '王源', w: '王源' },
D4:
 { t: 's',
   v: '18613109175',
   r: '<t>18613109175</t>',
   h: '18613109175',
   w: '18613109175' },
E4:
 { t: 's',
   v: '广东省 广州市 白云区 金钟横路',
   r: '<t>广东省 广州市 白云区 金钟横路</t>',
   h: '广东省 广州市 白云区 金钟横路',
   w: '广东省 广州市 白云区 金钟横路' },
F4:
 { t: 's',
   v: 'kelly ',
   r: '<t xml:space="preserve">kelly </t>',
   h: 'kelly ',
   w: 'kelly ' },
G4:
 { t: 's',
   v: 'kelly ',
   r: '<t xml:space="preserve">kelly </t>',
   h: 'kelly ',
   w: 'kelly ' },
H4:
 { t: 's',
   v: '18588866312',
   r: '<t>18588866312</t>',
   h: '18588866312',
   w: '18588866312' },
J4:
 { t: 's',
   v: ' 广州市天河区珠江新城猎德大道珠江别墅C6  顺丰到付',
   r: '<t xml:space="preserve"> 广州市天河区珠江新城猎德大道珠江别墅C6  顺丰到付</t>',
   h: ' 广州市天河区珠江新城猎德大道珠江别墅C6  顺丰到付',
   w: ' 广州市天河区珠江新城猎德大道珠江别墅C6  顺丰到付' },
K4:
 { t: 's', v: '到付现结', r: '<t>到付现结</t>', h: '到付现结', w: '到付现结' },
N4:
 { t: 's',
   v: '126号单 白卫衣2',
   r: '<t>126号单 白卫衣2</t>',
   h: '126号单 白卫衣2',
   w: '126号单 白卫衣2' },
P4: { t: 'n', v: 1, w: '1' },
Q4: { t: 'n', v: 1, w: '1' },
T4:
 { t: 's', v: '顺丰次日', r: '<t>顺丰次日</t>', h: '顺丰次日', w: '顺丰次日' },
AU4:
 { t: 's',
   v: '11月18日',
   r: '<t>11月18日</t>',
   h: '11月18日',
   w: '11月18日' },
AX4:
 { t: 's', v: '113号单', r: '<t>113号单</t>', h: '113号单', w: '113号单' },
'!margins':
 { left: 0.75,
   right: 0.75,
   top: 1,
   bottom: 1,
   header: 0.5,
   footer: 0.5 }
}

// const json = XLSX.utils.sheet_to_json(workbook.Sheets['导入数据表'], {header:"A"})

// console.info(json)

// const ws = XLSX.utils.json_to_sheet(json)
// console.info(ws)

const wb = XLSX.utils.book_new()
XLSX.utils.book_append_sheet(wb, sheet, 'whatever');
XLSX.writeFile(wb, 'out.xls')